<template>
  <div class="container">
    <header>
      <h1>Автодиагност-Н</h1>
      <p>Сервис компьютерной диагностики ДВС и АКПП</p>
    </header>

    <section class="info">
      <h2>О нас</h2>
      <p>Кодирование блоков управления</p>
      <p>Адаптация блоков управления</p>
      <p>Сброс сервисных интервалов</p>
      <p>Считывание потоков данных систем автомобиля</p>
      <p>Отображение текущих параметров системы</p>
      <p>Проверка исполнительных механизмов</p>
      <p>Чтение и расшифровка кодов неисправностей систем автомобиля</p>
    </section>

    <section class="services">
      <h2>Наши услуги</h2>
      <p><strong>Компьютерная диагностика:</strong> 800 руб</p>
    </section>

    <section class="contact">
      <h2>Контакты</h2>
      <p><strong>Адрес:</strong> г. Новосибирск, ул. Выставочная, 4</p>
      <p><strong>Время работы:</strong> Пн-Пт с 9:00 до 18:00</p>
      <p><strong>Без обеда и выходных</strong></p>
      <p><a :href="mapLink" target="_blank">Как проехать</a></p>
      <p><strong>Телефон:</strong>
        <a href="tel:+79139561544" target="_blank" class="whatsapp-link">
          <svg width="24" height="24" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg" fill="none">
            <path d="M7.8992 16.1003C1.71202 9.91313 2.10865 5.13406 4.93707 3.01274C5.14328 2.85808 5.34662 2.70651 5.5471 2.55803L5.54708 2.55801C6.21282 2.06494 7.15221 2.20492 7.64528 2.87065C7.65431 2.88285 7.66316 2.89518 7.67182 2.90765L9.24358 5.1703C9.68111 5.80017 9.57306 6.65862 8.99309 7.16042L7.5696 8.39207C7.08994 8.80708 6.92316 9.47893 7.15306 10.0701C7.61299 11.2527 8.56171 12.5628 9.9992 14.0003C11.4365 15.4376 12.7462 16.3861 13.9284 16.8457L13.9284 16.8456C14.5195 17.0755 15.1913 16.9087 15.6062 16.429L16.838 15.0054C17.3398 14.4254 18.1983 14.3173 18.8281 14.7549L21.0936 16.3286C21.774 16.8012 21.9424 17.7359 21.4697 18.4163C21.4614 18.4284 21.4528 18.4403 21.4441 18.4521C21.2953 18.6533 21.1434 18.8573 20.9884 19.0641C18.8671 21.8925 14.0864 22.2875 7.8992 16.1003Z" fill="currentColor"></path>
          </svg>
          +7 (913) 956-15-44</a></p>
      <p>
        <a href="https://wa.me/79139561544" target="_blank" class="whatsapp-link">
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" width="24" height="24" fill="currentColor">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.0835 4.90805C17.2029 3.03588 14.7064 2.00475 12.043 2C6.5537 2 2.09069 6.44761 2.08592 11.9073C2.08592 13.656 2.54415 15.3571 3.41289 16.8634L2 22L7.27923 20.622C8.73508 21.4108 10.3723 21.8289 12.0382 21.8289H12.043C17.5274 21.8289 21.9952 17.3813 22 11.9168C22 9.27013 20.9642 6.78023 19.0835 4.90805ZM12.043 20.1563C10.5537 20.1563 9.09785 19.7572 7.82816 19.0064L7.52745 18.8258L4.39618 19.6431L5.2315 16.602L5.0358 16.2884C4.20525 14.977 3.77088 13.4612 3.77088 11.9073C3.77088 7.3647 7.48449 3.67261 12.0477 3.67261C14.2578 3.67261 16.3341 4.53267 17.8998 6.08648C19.4606 7.64505 20.3198 9.71205 20.3198 11.9121C20.315 16.4595 16.6014 20.1563 12.043 20.1563ZM16.5823 13.9838C16.3341 13.8603 15.1122 13.2616 14.8831 13.1761C14.6539 13.0953 14.4869 13.0525 14.3246 13.2996C14.1575 13.5467 13.6802 14.1074 13.537 14.2689C13.3938 14.4353 13.2458 14.4543 12.9976 14.3307C12.7494 14.2072 11.9475 13.9458 10.9976 13.1C10.2578 12.4443 9.76134 11.6317 9.61337 11.3847C9.47017 11.1376 9.59904 11.0045 9.72315 10.881C9.83293 10.7717 9.97136 10.5911 10.0955 10.4486C10.2196 10.306 10.2625 10.2015 10.3437 10.0352C10.4248 9.86885 10.3866 9.7263 10.3246 9.60276C10.2625 9.47921 9.76611 8.25802 9.55609 7.76384C9.35561 7.27916 9.15036 7.34569 8.99761 7.34094C8.85441 7.33143 8.68735 7.33143 8.52029 7.33143C8.35322 7.33143 8.08592 7.39321 7.8568 7.6403C7.62769 7.88738 6.98807 8.4861 6.98807 9.70729C6.98807 10.9285 7.88067 12.1022 8.00477 12.2685C8.12888 12.4348 9.75656 14.9342 12.253 16.0081C12.8449 16.2647 13.3079 16.4167 13.6706 16.5308C14.2673 16.7208 14.8067 16.6923 15.2363 16.6306C15.7136 16.5593 16.7064 16.0318 16.9165 15.4521C17.1217 14.8724 17.1217 14.3782 17.0597 14.2737C16.9976 14.1692 16.8305 14.1074 16.5823 13.9838Z"></path>
          </svg>
          WhatsApp
        </a>
      </p>
    </section>

  </div>
</template>

<script>
export default {
  data() {
    return {
      mapLink: "https://yandex.ru/maps?ll=82.88547599999999704323272454%2C54.98549299999999817600837559&mode=routes&rtext=~54.98549299999999817600837559%2C82.88547599999999704323272454&z=17"
    };
  }
};
</script>

<style scoped>
.whatsapp-link {
  color: #25D366; /* Зеленый цвет WhatsApp */
  font-size: 16px;
  text-decoration: none;
  display: inline-flex;
  align-items: center;
}

.whatsapp-link svg {
  margin-right: 8px; /* Отступ между иконкой и текстом */
}


.container {
  font-size: 19px;
  padding: 20px;
  font-family: "Tahoma", sans-serif; /* Компактный и аккуратный */
  position: absolute;
  top: 20px;
  left: 50%;
  transform: translate(-50%);
}

header {
  text-align: center;
  background-color: rgba(255, 153, 0, 0.7);
  border: 2px solid #000000;
  color: #000000;
  padding: 30px;
  border-radius: 18px;
  width: 100%;
}

header h1 {
  white-space: nowrap;
}

section {
  margin-top: 20px;
  padding: 15px;
  border: 2px solid #000000;
  border-radius: 18px;
  width: 100%;
  max-width: 800px;
  text-align: center;
  background-color: rgba(249, 249, 249, 0.8);
  box-shadow: 0 4px 6px rgba(0, 0, 0, 0.1);

}

.contact a {
  color: #000000;
  text-decoration: none;
  font-weight: bold;
}

</style>
